src/ExchangePlans/СОД_Узлы/СОД_Узлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="b3faf631-ce22-48a7-a3f3-91d262422d2e">
  <name>СОД_Узлы</name>
  <attributes>
    <name>Узел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколДоставкиОтправлений</name>
    <type>
      <types>EnumRef.СОД_ПротоколыДоставкиОтправлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСообщения</name>
    <type>
      <types>EnumRef.СОД_ФорматыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсходящихОтправлений</name>
    <type>
      <types>EnumRef.СОД_ВерсияОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВходящихОтправлений</name>
    <type>
      <types>EnumRef.СОД_ВерсияОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBURIПространстваИменСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEBИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_НоваяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMQPСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяТочкиОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТранспортПодтверждение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPИсходящееИмяОчередиТочкаАктуальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяТочкиОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТранспортПодтверждение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMQPВходящееИмяОчередиТочкаАктуальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/ExchangePlans/СОД_Узлы/ObjectModule.bsl
#Если Сервер Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(HTTPИмяСервиса) Тогда
		HTTPИмяСервиса = "sed-web";
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(WEBURIПространстваИменСервиса) Тогда
		WEBURIПространстваИменСервиса = "asrv.r5g.ru";
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(WEBИмяСервиса) Тогда
		WEBИмяСервиса = "SED_WEB";
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(WEBИмяТочкиПодключения) Тогда
		WEBИмяТочкиПодключения = "SED_WEBSoap";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПротоколДоставкиОтправлений = Перечисления.СОД_ПротоколыДоставкиОтправлений.HTTPСервис Тогда
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP());
	ИначеЕсли ПротоколДоставкиОтправлений = Перечисления.СОД_ПротоколыДоставкиОтправлений.WEBСервис Тогда
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP());
	Иначе
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP());
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP());
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива); 
	
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры

#КонецОбласти

#КонецЕсли
